blasius_laminar_github/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    zeroGradientPlanes
    {
        type            partch;
        nFaces          220;
        startFace       19000;
        faces           ( ( 1 5 4 0 ) ( 8 10 11 9 ) ( 3 7 6 2 ) ( 2 6 11 9 ) );
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       19220;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       19300;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19400;
    }
)

// ************************************************************************* //
