blasius_laminar_github/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    zeroGradientPlanes
    {
        type            zeroGradient;
    }

    plate
    {
        type            noSlip;
    }

    inlet
    {
         type            fixedValue;          
         value           uniform (1 0 0); 
    }

    //rightSide
    // {
    //   type            zeroGradient;
    //}

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
